export type TteamMessages = {
  name: string;
  team: string;
  message: string;
  password?: number;
};

export const armyMessages: TteamMessages[] = [
  {
    name: "채동욱",
    team: "산업기능요원",
    message: ``,
  },
  {
    name: "김현민",
    team: "산업기능요원",
    message: ``,
  },
  {
    name: "박현수",
    team: "산업기능요원",
    message: `동근님 전역 축하드립니다. 사실 저도 얼마 안남았다고 혼자 생각중인데 실제로 복무가 끝나신 분을 보니, 빨리 시간이 지나갔으면 좋겠다는 생각 뿐입니다.
동근님께서 저 처음 들어 왔을 때 챙겨주시고, 지금까지도 이것 저것 많이 챙겨주셔서 회사에 빠르게 적응했던 것 같습니다. 감사드립니다. 동근님께서 학교에서 만나면 점심을 사주시겠다고 약속해주셨는데 졸업하시기 전에 찾아뵙도록 하겠습니다. 다시 한번 전역 축하드리고, 앞으로 동근님께 좋은 일만 가득하길 바라겠습니다. 1년 반 정도 감사했습니다. 저도 금방 따라가겠습니다.`,
  },
];

export const devTeamMessages: TteamMessages[] = [
  {
    name: "윤세나 대리님",
    team: "서비스개발팀",
    message: `시간이 참 빠르네요 벌써 나갈때가 됐다는게 안믿겨요...
처음 들어오셨던게 엊그제 같은데 벌써 이렇게나 시간이 지나버렸네요.
입사 초반에 한참 바쁠 때 들어오셔서 제대로 챙겨주지도 못해서 되돌아보면 미안한 순간이 많아요.
그래도 묵묵히 할 수 있는 일 찾아서 열심히 해줘서 고마웠어요ㅎㅎ
편지를 쓰다보니 미안하고 고마웠던 기억밖에 없어서 뭔가 반복적으로 사과랑 고마웠던 얘기를 계속 하는것 같긴한데 그래도 이해해줘요ㅋㅋㅋ
종종 동근님 볼때마다 모든일에 항상 열정적이구나 배울게 많은 사람이다 생각했던것 같아요.
언제나 최선을 다하고 열정적인 모습이 저한테는 긍정적인 자극이 많이 됐어요
그래서 일하기 싫을때 동근님 하시는거 보고 정신차리고 일해야지 생각할때가 종종 있었어요ㅋㅋ말은 못했었지만요.
그런데 이제 마지막이라고 생각하니 너무 아쉽네요...
아쉽지만 그동안 너무 고생많았어요, 제대하고나면 이곳저곳 많이 놀러다니시구 즐겨요ㅋㅋㅋㅋ
그동안 고생 너무너무 많았고 앞으로 사회에 돌아가서 원하시는 바 모두 이루시길 응원할게요!
시간되시면 밥살게요 고생많았어요 동근님:)`,
  },
  {
    name: "문승현 과장님",
    team: "서비스개발팀",
    message: `동근아 시간 참 빨리간다~
비슷한 시기에 개발실에 들어왔는데 벌써 전역하다니...
동근이 보면서  많은 걸 느꼈던 것 같아~  내가 사원일 때 생각도 많이났어
너는 실력도 좋고 열정도 뛰어나서 좋은 자극을 줬어서 고맙게 생각해
퇴사하고 아침에 푹 쉬고 남은 학부 마무리 잘하고~ 
취업이든 스타트업이든 하고 싶은 거 맘껏하고 재밌게 일하길 바랄게~
좋은 인연 만들어서 좋았구 나중에 보게되면 반갑게 인사하자~
건강 잘 챙기구~~ 전역 축하한다!`,
  },
  {
    name: "김영은 과장님",
    team: "서비스개발팀",
    message: `친애하는 동료 동근님,
위메이드에서의 병역 특례 근무를 무사히 마치고 드디어 자유의 몸이 되는 것을 축하한다!
한창 바빴을 때 들어와서 한창 바쁠 때 떠나는 기분이네, 그래도 그동안 새로운 기술을 배우려고 항상 공부하고 적용하려고 하는 모습은 우리에게 큰 자극이 되었어.
이곳에서 한 땀 한 땀 만들어서 유저에게 선보이고 피드백 받고 이런 여러 가지 경험과 상황들이 앞으로 좋은 자료가 되었으면 좋겠다.
넌 앞으로 더 잘 될 테니까 여기서 떠나는 게 전혀 아쉽지 않을걸 알아 ㅋㅋㅋ 
내가 딱히 잘해주거나 챙겨주진 못했지만 말하면 잘 따라와 주고 묵묵히 맡은 일을 열심히 해줘서 속으로 많이 고마워하고있었단다.
앞으로 더 잘 될 테니까 항상 자신감 가지고 건강 잘 챙기고 다른 곳에서도 열정 넘치고 파이팅 한 모습으로 이쁨 많이 받기를 바라 고마웠어 안녕`,
  },
  {
    name: "이한우 팀장님",
    team: "서비스개발팀",
    message: `짧으면 짧고, 길다고 생각하면 길수 있는 2년이라는 시간이 어느새 다가오는구나.
우리팀으로 와서 어떤 업무를 시키면 맞을까 고민해서 좋아할 만한 업무를 줬는데 만족했는지 모르겠다.
항상 배움에 목마르고, 주어진 업무를 잘하기 위해 노력하는 모습이 너무 좋았어. 어디를 가든 그런 모습으로 산다면 훌륭한 사람이 될 수 있을거야.
우리 팀에서 막내로 누구보다 열심히 일해줘서 고맙고, 내가 해준것이 없는것 같아 미안한 마음도 남는다.
앞으로 살아가면서 이곳에서의 노력이 밑거름이 되었으면 좋겠다.
동근이한테 좋은 팀장, 훌륭한 팀장이었는지 모르겠다.
이곳에서의 여러 사람들의 행동을 생각해보고, 그 생각들을 발판삼아 앞으로 어떻게 행동하는 것이 발전하는 길인지 생각하면 더 나은 동근이가 될 수 있을거라 생각해.
좋은 동료, 사랑스런 남편, 멋진 아빠가 되길 바랄께.`,
  },
  {
    name: "백승우",
    team: "프론트개발팀",
    message: `형 나도 이제 말 놓을게. `,
  },
  {
    name: "김정환 대리님",
    team: "프론트개발팀",
    message: `안녕하세요 동근님~
벌써 전역이라니 너무 축하드려요ㅎ
처음 들어왔을 때 인상부터 성격도 좋고 일도 똑 부러지게 일하는 동근님이랑 같이 일할수 있어서 너무 기뻤어요.
항상 상대방 배려하면서 조심스럽게 업무요청 해주는 모습에 배울점도 많고 정말 성실한 분이라고 생각했어요.
병특 군단 수장으로써 다들 동근님한테 의지도 하는거 같아보이고, 회사생활도 보면서 참 잘한다 싶었어요. 
저는 군생활하면서 괴롭기보다 추억도 많이 쌓고 배운점이 더 많아서 좋은 기억도 많았는데
동근님한테 저도 위메이드도 좋은 추억이 되었으면 좋겠어요.
혹시 저 때문에 힘든거 있었으면 사과할게요.ㅎㅎ
병특기간이 생각보다 짧은거 같아요 ㅋㅋ
좀더 같이 일할 수 있는 시간이 길었으면 하는 아쉬움도 드네요.
전역 정말 축하드리고, 퇴사후에도 쭉 잘되길 응원할게요~`,
  },
  {
    name: "이철환 대리님",
    team: "프론트개발팀",
    message: `동근님 2년간의 군생활 마무리를 축하합니다.

처음의 동근님은 제가 입사하기 전이라 잘 모르겠지만 업무적으로나 인간적으로나 많은 성장을 했을거란 생각이 들고, 2년이 짧으면 짧고 길면 긴 경험이었을텐데 나빴던 기억들 모두 버리시고 좋았던 기억만 간직했음 좋겠고, 실패했던 경험을 바탕으로 많은 성장을 했음 좋겠습니다.

그동안 업무적으로 같이 한 적은 많진 않지만 뒤에서나마 동근님을 지켜봤을 때 열정적이고, 책임감 있는 모습이 많이 보여 좋은 영향을 받았습니다.

앞으로의 대학 생활 그리고 동근님이 원하는 모든 것을 이룰 수 있길 바래요.
도움이 필요하거나 힘들면 편하게 연락하세요!

건강하고 행복하시고 해피 코딩하세요!!

-이철환`,
  },
  {
    name: "정경주 과장님",
    team: "프론트개발팀",
    message: `to 동근
동근님 우선 무사전역을 축하해요~
벌써 2년이 됐다니 시간엄청빠르네요 업무적으로 많이 접점이 없었기도하고, 제가 말수가 없다보니 사적대화도 많이 못해서 아직 동근님을 잘 모르지만 이거 하난 알아요! 예의범절 바른 모범 청년이라는 것을ㅋㅋ 앞으로도 그런 기조 유지하시고, 앞날이 창창하니 육각형 스펙도(부럽)쭉 업그레이드 하세용 모쪼록 나가서도 몸조심하시고 하시는 일 잘 되기를 바랍니당 또 봐요!!`,
  },
  {
    name: "나상욱 과장님",
    team: "프론트개발팀",
    message: `서: 서울대의 명성에 걸맞는 수행 능력으로 
동: 동료들과 함께 백엔드를 정복한 그 남자,
근: 근데 이제 전역하면 우리 누구랑 일해요??

동근님
아니 동근아 

이제는 편하게 얘기해도 되겠지? 
참 시간이 빨리 흘러가네~

나는 십수년을 일하면서 
서울대 출신 개발자와 함께 일을 해본건 너가 처음이야 
서울대란 명성에 걸맞는 퍼포먼스와 매너를 
2년이란 시간동안 변함없이 보여줬는데 
이런 서동근과 함께 일할 수 있어서 
나는 참 좋았고 행운이라 생각해

너도 좋았는지 모르겠지만 
내게 부족함이 보였더라도 이해해주길 바래 ㅎㅎ

이제 곧 졸업 준비도 할테고 
졸업후엔 진짜 사회에 발을 내딛게 될텐데 
너가 계획한 사업이든 그 무엇이든 
다시는 돌아오지 않을 
가장 젊은 시기이기에 
'실패'를 생각하지 말고 
강하게 밀어붙였으면 좋겠어 

마지막으로 
하고싶은 다양한 일들을 하게 되면 
체력이 그 무엇보다 중요하다는걸 알게 될거야

너가 그 무엇을 하든 
'달리기'는 네 원동력의 밑거름이 되어줄테니 
거르지 말고 조금씩이라도 
꾸준히 하길 바래 ㅎㅎ

2년동안 고생했고 
나가서 서동근의 꿈을 펼쳐봅시다
서동근 파이팅!`,
  },
  {
    name: "김태오 팀장님",
    team: "프론트개발팀",
    message: `동근에게..  잘생기고 공부잘하고 인성좋은 동근님 .. 그중에 내가 가장 좋아하는건 동근님의 인성입니다 . 어디에서든 원하시는 일을 이룰것이라 믿습니다 , 건승하세요 , `,
  },
];

export const otherTeamMessages: TteamMessages[] = [
  {
    name: "강선구 팀장님",
    team: "웹서비스팀",
    message: `동그리동동 전역축하축하
    병특의 기둥, 개발실의 차은우, 상무님의 애사원 서동근 병장 전역을 축하합니다.
    서버 개발의 스페셜리스트
    동생의 전역과 앞날을 응원합니다.
    근대 계속 위메이드에서 일해주면 안되겠니?`,
  },
  {
    name: "황선영 과장님",
    team: "웹서비스팀",
    message: `동근님...
광주.. 왜 저 안데려가셧서요..?ㅜㅜ
기아 우승 챔필 직관 부러워요...!!!
ㅋㅋㅋㅋㅋ전역 추카드림니다~~
대화도 못나눠봤지만 항상 열심히 하시는 모습 보기 좋았습니다!
그동안 고생 많으셨어요:)`,
  },
  {
    name: "노서정 대리님",
    team: "웹서비스팀",
    message: `동근님 안녕하세요..
경주 과장님이랑 소리 없이 제 자리 오셔서 깜짝 놀랐던 때가 바로 어제 같은데 전역하신다니 ㅠ.ㅜ

동근님이랑은 생각보다 업무를 많이 못해봐서,
이제 좀 친해진 것 같은데 (ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ) 아쉽네요...

승우님이 본인 혼낸 멘트보다 길어야 된다고 하시는데 그렇다고 제가 동근님을 혼낼 순 없어서 고민하면서 썼어요.

2025년에는 위메이드 밖에서 행복하고 즐거운 하루하루 되시기를 바라요~!
승우님이랑도 오래 오래 행복하시기를 응원함니다. 고생 많으셨어요 ㅎ_ㅎ)b`,
  },
  {
    name: "안주연 대리님",
    team: "웹서비스팀",
    message: `서울 사시는 동근님 
동천 사는 주연입니다
근처에 살면 탈출 기념 식사 한판 사드리는건데 너무 ㅁㅓ네요.. 앞으로도 화이팅하시고 위메이드에서 고생 많이하셨습니다 ! 앞으로도 승승장구 하시길 바랄께여`,
  },
  {
    name: "임경민 님",
    team: "웹서비스팀",
    message: `안녕하세요 동그리동동 동근님! 전역 축하드립니다~~
동근님과 직접적으로 협업한 경험은 없지만,, 승우님한테 종종 이야기 듣고 혼자 내적 친밀감 생겨 몇 자 적어봅니다!ㅎㅎ
그동안 고생 많으셨고, 좋은 기억만 가지고 떠나시길 바랄게요! 
남은 학교 생활도 화이팅하세요! 넘 고생하셨습니다~~`,
  },
  {
    name: "송유진 대리님",
    team: "사업팀",
    message: `동근씨 이제 곧 있으면 전역이라니 넘넘 축하해요!!정산 때문에 고생하던게 엊그제 같은데, 벌써 퇴사라니 아쉽네요ㅠㅠㅠㅠ
첫 회사 생활하는거 힘들었겠지만, 안좋은 일은 잊고 좋은 기억만 가져가요ㅎㅎ문제 있을 때마다 도와줘서 너무 고마웠고, 하고 싶은 일 꼭 찾아서 다음 회사 생활도 재밌게 하길 바랄게요! 진짜 고생 많았고 다시 한번 전역 축하합니당🥳🥳`,
  },
  {
    name: "석헌종 팀장님",
    team: "클라우드운영팀",
    message: ``,
  },
  {
    name: "최민지 대리님",
    team: "클라우드운영팀",
    message: ``,
  },
  {
    name: "신혜인 님",
    team: "인사팀",
    message: `안녕하세요 서동근님. 신혜인입니다.

서동근님이 입사하신 23년 1월이 떠오르네요.
저도 그때 막 입사했던 때라 잔뜩 긴장한 채 서동근님의 편입을 처리했던 기억이 납니다. 그땐 24년 12월이 까마득했는데, 벌써 전역이시라니.. 정말 고생 많으셨고, 축하드립니다. 
저희 모두 2년의 시간 동안 많이 성장하고 발전했겠죠 ??

저의 성실한 병특 1호이자, 좋은 동료, 동갑 친구가 되어주셔서 감사해요. 위메이드에서의 모든 시간이 서동근님께 행복한 기억으로 남길 바라며, 하고자 하시는 모든 일들 전부 잘 되시길 빌어요.

항상 건강하시고 추운 날씨 감기 조심하세요.
신혜인 드림.`,
  },
  {
    name: "김다영 실장님",
    team: "커뮤니티팀",
    message: `개고생 참으며 개발해 주셔서 감사하고, 졸업하면 다시봐요~~`,
  },
  {
    name: "김호훈 팀장님",
    team: "커뮤니티팀",
    message: `동근님, 개인적으로 술한잔 못하고 업무적으로만 대화하다가 작별하게 되었네요. 동근님을 쭉 지켜봤는데 개발에 진심이고 열정적인 모습 너무 보기 좋았습니다. 그 모습 그대로 어딜 가셔도 꼭 성공하실거라고 믿습니다. 고생 많이 하셨고 좋은 소식으로 또다시 뵙기를 바라겠습니다. 감사합니다.`,
  },
  {
    name: "장민훈 대리님",
    team: "커뮤니티팀",
    message: `ヱ생 끝 행복 んı작! nㅓ동근 ㅍr○l팅`,
  },
  {
    name: "박진수 대리님",
    team: "커뮤니티팀",
    message: `하필 미르엠 처음부터 끝까지 고생만 하시다 가시네요ㅠ 졸업 후엔 좋은 프로젝트 만나서 행복한 개발 생활(?) 되시길 바랍니다!`,
  },
];
